{"backend": "theano", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "dtype": "float32", "batch_input_shape": [null, 1, 15, 80], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 10, "name": "conv2d_1", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [7, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [1, 3], "data_format": "channels_first", "strides": [1, 3], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 20, "name": "conv2d_2", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [1, 3], "data_format": "channels_first", "strides": [1, 3], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 256, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "sigmoid"}}], "keras_version": "2.0.2"}