{"backend": "theano", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [7, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 1, 15, 80], "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "padding": "valid", "filters": 10}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "trainable": true, "strides": [1, 3], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [1, 3]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "padding": "valid", "filters": 20}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "trainable": true, "strides": [1, 3], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [1, 3]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "units": 256, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "units": 1, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "sigmoid"}}]}