{"class_name": "Sequential", "backend": "theano", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 1, 15, 80], "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "filters": 10, "activation": "linear", "bias_regularizer": null, "name": "conv2d_1", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "kernel_size": [7, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 3], "trainable": true, "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [1, 3]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "filters": 20, "activation": "linear", "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_first", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 3], "trainable": true, "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [1, 3]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 256, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 1, "activation": "linear", "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_4"}}], "keras_version": "2.0.2"}